Revit 2026 API

# OBJImportOptions(OBJImportOptions) Constructor

---

Constructs a new instance of OBJImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public OBJImportOptions(
	OBJImportOptions option
)
```
```vb
Public Sub New (
	option As OBJImportOptions
)
```
```cpp
public:
OBJImportOptions(
	OBJImportOptions^ option
)
```
```fsharp
new :
        option : OBJImportOptions -> OBJImportOptions
```

#### Parameters

option OBJImportOptions
     The OBJ options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

OBJImportOptions Class

OBJImportOptions Overload

Autodesk.Revit.DB Namespace